
{
    "cv": "Download CV",
    "function": "Django Python Engineer | Full Stack Developer",
    "greeting": "Welcome to my profile",
    "name": "Full Name",
    "location": "Location",
    "programing_language": "Programming Languages",
    "webframework": "Web Frameworks",
    "libraries": "Libraries",
    "db": "Database management",
    "version_control": "Version control system",
    "testing_tool":  "Testing tool",
    "other_related_technologie":  "Other related technologie  skills",
    "whoiam":  "WHO AM I",
    "highly_skill_django_python":  "Highly skilled Django Python Engineer with 4 years of experience in developing web applications and APIs. Strong understanding of software development principles, database design, security and performance practices. Passionate about creating robust and scalable solutions. Excellent problem-solving and communication skills",
    "my_main_skill":  "My main skill is designing , developing and maintain web application using django framework and react js",
    "what_to_expect_from_me":  "What to expect from me",
    "webapplication_development":  "Web-applications development, the backend with django and django REST framework API's, while the frontend with react framework and other third part libraries(material design, etc...)",
    "strong_understanding_of_database":  "Strong understanding of database management, structure , designing and implementing(django ORM layer for example) for store and retrieve data's",
    "building_apis":  "Building Api's and microservices with django and django REST framework ",
    "testing_debugging":  "Testing and debugging using pytest and pytest-django to ensure the quality and reliability of the application",
    "being_familiar_with_common":  "Being familiar with common security practices for implementing to protect user data and prevent common vulnerability. ",
    "optimization_of_the_application":  "Optimization of the application's performance by analyzing and improving its speed, scalability and resources usage",
    "for_the_apps_version_control":  "For de apps version control, i am familiar with Git, a crucial tool to manage code changes, track project progress and coordinate with team members, stackholders, etc...",
    "deployment_django":  "Deployment django application to production environment",
    "enabling_user_experience":  "Enabling user experience by implementing the frontend with react , html/css en javascript to create user interfaces",
    "continuousely_learning":  "Continuousely learning and self-improvement to stay up to date with the latest technologies methodes,libraries, etc.",
    "develop_and_maintain":  "Develop and maintain web application using Django,Python , Javascript and React.",
    "collaborate_with_cross_function":  "Collaborate with cross-functional teams to gather requirements and design scalable solutions.",
    "implement_rest_full":  "Implement RESTful API’S for data retrieval and manipulation",
    "optimize_applications":  "Optimize application performance through code refactoring and database query optimization",
    "analize_data":  "Analyzing data",
    "help_team_members":  "Help team members to understand the fundamentals of application development",
    "develop_maintain_2":  "Develop and maintain applications for differents custormers",
    "develop_new_functionalities":  "Develop new funtionalities in de Niagara environment to be able to communicate with third part API’S.",
    "understanding_the_fundamentals":  "Understanding the fundamentals of hardware side (sensors , motors, cables)",
    "develop_maintain_3":    " Develop and maintain the website",
    "help_in_maintaining_intranet":  "Help in maintaining the intranet app inside the company",
    "develop_microservices":  "Develop microservices needed in the company",
    "managing_social_apps":  "Managing social apps for the company",
    "making_flyers_videos":  "Making flyers, video’s, posters for promotions",
    "relevant_course_work":  "Relevant coursework",
    "languages": "Languages"

}